In [32]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import log_loss
from sklearn.metrics import mean_squared_error as mse
from sklearn.metrics import classification_report

In [38]:
df = pd.read_csv('df.csv')

In [39]:
df.head()

,Unnamed: 0,CreditScore,Geography,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,0,619,France,42,2,0.00,1,1,1,101348.88,1,0
1,1,608,Spain,41,1,83807.86,1,0,1,112542.58,0,0
2,2,502,France,42,8,159660.80,3,1,0,113931.57,1,0
3,3,699,France,39,1,0.00,2,0,0,93826.63,0,0
4,4,850,Spain,43,2,125510.82,1,1,1,79084.10,0,0

In [40]:
df = df.drop('Unnamed: 0',axis=1)

In [41]:
df.head()

,CreditScore,Geography,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,619,France,42,2,0.00,1,1,1,101348.88,1,0
1,608,Spain,41,1,83807.86,1,0,1,112542.58,0,0
2,502,France,42,8,159660.80,3,1,0,113931.57,1,0
3,699,France,39,1,0.00,2,0,0,93826.63,0,0
4,850,Spain,43,2,125510.82,1,1,1,79084.10,0,0

In [42]:
up_df = pd.get_dummies(df)

In [43]:
up_df.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender,Geography_France,Geography_Germany,Geography_Spain
0,619,42,2,0.00,1,1,1,101348.88,1,0,1,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,0,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,0,1,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,1,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,0,0,1

In [44]:
X = up_df.drop('Exited',axis=1)
y = up_df['Exited']

In [45]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=1)

In [46]:
model = LogisticRegression()

In [47]:
model.fit(X_train,y_train)

LogisticRegression()

In [48]:
pred = model.predict(X_test)

In [49]:
pred

array([0, 0, 0, ..., 0, 0, 0])

In [50]:
accuracy_score(pred,y_test)

0.7876

In [51]:
confusion_matrix(pred,y_test)

array([[1946,  497],
       [  34,   23]])

In [52]:
mse(pred,y_test)

0.2124

In [53]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.98      0.80      0.88      2443
           1       0.04      0.40      0.08        57

    accuracy                           0.79      2500
   macro avg       0.51      0.60      0.48      2500
weighted avg       0.96      0.79      0.86      2500

In [54]:
#credit score outlier removed

In [17]:
df_c = pd.read_csv('c_out_df.csv')

In [18]:
df_c.head()

,Unnamed: 0,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,0,619,France,Female,42,2,0.00,1,1,1,101348.88,1,0
1,1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,0
2,2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,0
3,3,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0
4,4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0

In [21]:
df_c=df_c.drop(['Gender','Unnamed: 0'],axis=1)
df_c=pd.get_dummies(df_c)

In [22]:
df_c.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender,Geography_France,Geography_Germany,Geography_Spain
0,619,42,2,0.00,1,1,1,101348.88,1,0,1,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,0,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,0,1,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,1,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,0,0,1

In [23]:
X = df_c.drop('Exited',axis=1)
y = df_c['Exited']

In [24]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=1)

In [25]:
model = LogisticRegression()

In [26]:
model.fit(X_train, y_train)

LogisticRegression()

In [27]:
pred = model.predict(X_test)

In [28]:
accuracy_score(pred,y_test)

0.7924679487179487

In [35]:
confusion_matrix(y_test,pred)

array([[1952,   43],
       [ 475,   26]])

In [34]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.98      0.80      0.88      2427
           1       0.05      0.38      0.09        69

    accuracy                           0.79      2496
   macro avg       0.52      0.59      0.49      2496
weighted avg       0.95      0.79      0.86      2496

In [55]:
#age outlier removed

In [56]:
df_a = pd.read_csv('a_out_df.csv')

In [57]:
df_a.head()

,Unnamed: 0,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,0,619,France,Female,42,2,0.00,1,1,1,101348.88,1,0
1,1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,0
2,2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,0
3,3,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0
4,4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0

In [59]:
df_a = df_a.drop(['Unnamed: 0','Gender'],axis=1)
df_a = pd.get_dummies(df_a)

In [60]:
df_a.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender,Geography_France,Geography_Germany,Geography_Spain
0,619,42,2,0.00,1,1,1,101348.88,1,0,1,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,0,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,0,1,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,1,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,0,0,1

In [61]:
X = df_a.drop('Exited',axis=1)
y = df_a['Exited']

In [62]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=1)

In [63]:
model = LogisticRegression()

In [64]:
model.fit(X_train,y_train)

LogisticRegression()

In [65]:
pred = model.predict(X_test)

In [66]:
accuracy_score(pred,y_test)

0.7964970809007507

In [67]:
confusion_matrix(pred,y_test)

array([[1855,  443],
       [  45,   55]])

In [69]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.98      0.81      0.88      2298
           1       0.11      0.55      0.18       100

    accuracy                           0.80      2398
   macro avg       0.54      0.68      0.53      2398
weighted avg       0.94      0.80      0.85      2398